app/views/booklists/index.html.erb

                            <td><% if user_signed_in? %>
                                    <%if Focusbooklist.exists?(user_id: @currentuser.id, booklist_id: booklist.id) %>
---
SELECT  1 AS one FROM "focusbooklists" WHERE "focusbooklists"."user_id" = ? AND "focusbooklists"."booklist_id" = ? LIMIT 1  [["user_id", 1], ["booklist_id", 1]]
SELECT "booklists".* FROM "booklists"