app/controllers/booksinlists_controller.rb

SELECT "booksinlists".* FROM "booksinlists"
SELECT "books".* FROM "books" INNER JOIN "booksinlists" ON "booksinlists"."book_id" = "books"."id" WHERE "booksinlists"."booklist_id" = ?  [["booklist_id", 1]]
---
  def index
    @booksinlists = Booksinlist.all
    @booksinthelist = Book.joins(:booksinlists).where(booksinlists: {booklist_id: params[:id]})

SELECT  "booksinlists".* FROM "booksinlists" WHERE "booksinlists"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_booksinlist
      @booksinlist = Booksinlist.find(params[:id])