app/controllers/booklists_controller.rb

  def index
    @booklists = Booklist.limit(10)
---
SELECT  "booklists".* FROM "booklists" LIMIT 10

  def postbook
    @oneinbooklists = Focusbooklist.create(user_id: params[:userid], booklist_id: params[:booklistid])
---
INSERT INTO "focusbooklists" ("user_id", "booklist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["booklist_id", 1], ["created_at", "2016-01-08 14:41:58.805091"], ["updated_at", "2016-01-08 14:41:58.805091"]]